---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.FamilyStructuralMaterialTypeFilter
source: html/3100c5cf-a63a-3652-67ff-93f220252b63.htm
---
# FamilyStructuralMaterialTypeFilter Methods

Applies the filter to a given element.